Торговля_11__демо/src/Catalogs/ОбъектыРасчетов/ОбъектыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыРасчетов</name>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасчетов</name>
    <type>
      <types>EnumRef.ТипыРасчетовСПартнерами</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСсылки</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаРасчетов</name>
    <type>
      <types>EnumRef.ТипыОбъектовРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <comment>Поле 22 &quot;Код&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Торговля_11__демо/src/AccumulationRegisters/РасчетыСКлиентами/РасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКлиентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КОплате</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Оплачивается</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Отгружается</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплатуКлиенту</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродажаПоЗаказу</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистратора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <comment>Заполняется для реализации товаров и услуг</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключатьПриКонтроле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимаяСуммаЗадолженности</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗалогЗаТару</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗачетаПоДатеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОплаты</name>
    <type>
      <types>EnumRef.ВариантыКонтроляОплатыКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКорОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьЗаказКлиента</name>
    <type>
      <types>DefinedType.ОбъектРасчетовСКлиентами</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Торговля_11__демо/src/Enums/ТипыРасчетовСПартнерами/ТипыРасчетовСПартнерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасчетовСПартнерами</name>
  <enumValues>
    <name>РасчетыСПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентом</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредитором</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебитором</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСАрендодателем</name>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/Enums/ТипыОбъектовРасчетов/ТипыОбъектовРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовРасчетов</name>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>Накладная</name>
  </enumValues>
  <enumValues>
    <name>ПлатежВозврат</name>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/Enums/ТипыДоговоров/ТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоговоров</name>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>ВвозИзЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>СДавальцем</name>
  </enumValues>
  <enumValues>
    <name>СДавальцем2_5</name>
  </enumValues>
  <enumValues>
    <name>СПереработчиком</name>
  </enumValues>
  <enumValues>
    <name>СПоклажедателем</name>
  </enumValues>
  <enumValues>
    <name>СХранителем</name>
  </enumValues>
  <enumValues>
    <name>СКомитентомНаЗакупку</name>
    <comment>00004303</comment>
  </enumValues>
  <enumValues>
    <name>СПереработчиком2_5</name>
  </enumValues>
  <enumValues>
    <name>РеализацияЧерезКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>СПереработчиком2_5_ЕАЭС</name>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/Catalogs/ПодарочныеСертификаты/ПодарочныеСертификаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодарочныеСертификаты</name>
  <owners>Catalog.ВидыПодарочныхСертификатов</owners>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МагнитныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <comment>Поле 22 &quot;Код&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <type>
      <types>EnumRef.ПорядокРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
</mdclass:Catalog>

Торговля_11__демо/src/Catalogs/ОбъектыРасчетов/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.Справочники.ДоговорыКонтрагентов)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.Справочники.ДоговорыМеждуОрганизациями)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.Справочники.Партнеры)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.Справочники.Контрагенты)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.Справочники.НаправленияДеятельности) Тогда
		Текст = НСтр("ru = 'Недостаточно прав для открытия формы выбора объекта расчетов.'");
		ОбщегоНазначения.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				СписокОбъектовРасчетов,
				"ТолькоОстатки",
				Ложь,
				ВидСравненияКомпоновкиДанных.Равно,
				НСтр("ru = 'Скрывать служебные'"),
				Истина,
				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	
	СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ВыборОснованияПлатежа", Параметры.ВыборОснованияПлатежа);
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ТипРасчетов") Тогда
		ЭтоРасчетыСКлиентами = Параметры.Отбор.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
		СписокОснованийПлатежа.ТекстЗапроса = ТекстЗапросаОснованийПлатежа(ЭтоРасчетыСКлиентами, Параметры.Отбор, 0);
		СписокДоговоровКонтрагентов.ТекстЗапроса = ТекстЗапросаОснованийПлатежа(ЭтоРасчетыСКлиентами, Параметры.Отбор, 1);
		СписокДоговоровМеждуОрганизациями.ТекстЗапроса = ТекстЗапросаОснованийПлатежа(ЭтоРасчетыСКлиентами, Параметры.Отбор, 2);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				СписокОбъектовРасчетов,
				"ТипРасчетов",
				Параметры.Отбор.ТипРасчетов,
				ВидСравненияКомпоновкиДанных.ВСписке,
				,
				Истина);
		МассивТиповРасчетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры.Отбор.ТипРасчетов);
		МассивТиповРасчетов.Добавить(Перечисления.ТипыРасчетовСПартнерами.ПустаяСсылка());
		СписокДоговоровКонтрагентов.Параметры.УстановитьЗначениеПараметра("ТипыРасчетовДоговоров", МассивТиповРасчетов);
		СписокДоговоровМеждуОрганизациями.Параметры.УстановитьЗначениеПараметра("ТипыРасчетовДоговоров", МассивТиповРасчетов);
		СписокТиповДоговоров = ?(ЭтоРасчетыСКлиентами, 
		                         ВзаиморасчетыКлиентСервер.ТипыДоговоровСКлиентом(),
		                         ВзаиморасчетыКлиентСервер.ТипыДоговоровСПоставщиком());
		СписокДоговоровКонтрагентов.Параметры.УстановитьЗначениеПараметра("ТипыДоговоров", СписокТиповДоговоров.ВыгрузитьЗначения());
	КонецЕсли;
	
	Если Параметры.ВыборОснованияПлатежа Тогда
		Заголовок = СтрШаблон(НСтр("ru = 'Выбор основания платежа %1'"),
			?(ЭтоРасчетыСКлиентами,НСтр("ru = 'клиента'"),НСтр("ru = 'поставщика'")));
	Иначе
		Заголовок = СтрШаблон(НСтр("ru = 'Выбор объекта расчетов с %1'"),
			?(ЭтоРасчетыСКлиентами,НСтр("ru = 'клиентом'"),НСтр("ru = 'поставщиком'")));
	КонецЕсли;
	
	УстановленоОтборов = 0;
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Партнер") И ЗначениеЗаполнено(Параметры.Отбор.Партнер) Тогда
		СписокПартнеров = Новый СписокЗначений;
		ПартнерыИКонтрагенты.ЗаполнитьСписокПартнераСРодителями(Параметры.Отбор.Партнер, СписокПартнеров);
		
		Если Параметры.Отбор.Партнер = Справочники.Партнеры.НашеПредприятие Тогда
			ЭтоРасчетыМеждуОрганизациями = Истина;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокОбъектовРасчетов,
			"Партнер",
			СписокПартнеров,
			ВидСравненияКомпоновкиДанных.ВСписке,
			,
			ЗначениеЗаполнено(СписокПартнеров));
			
		Если Параметры.ВыборОснованияПлатежа Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				СписокОснованийПлатежа,
				"Партнер",
				СписокПартнеров,
				ВидСравненияКомпоновкиДанных.ВСписке,
				,
				ЗначениеЗаполнено(СписокПартнеров));
				
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				СписокДоговоровКонтрагентов,
				"Партнер",
				СписокПартнеров,
				ВидСравненияКомпоновкиДанных.ВСписке,
				,
				ЗначениеЗаполнено(СписокПартнеров));
		КонецЕсли;
			
		Элементы.ОтборПартнер.Заголовок = Параметры.Отбор.Партнер;
		УстановленоОтборов = УстановленоОтборов + 1;
	Иначе
		Элементы.ОтборПартнер.Видимость = Ложь;
		Элементы.ЗаголовокПартнер.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Контрагент") Тогда
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда
			Если ТипЗнч(Параметры.Отбор.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
				Если ЗначениеЗаполнено(Параметры.Отбор.Контрагент) Тогда
					ПартнерКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Отбор.Контрагент, "Партнер");
				Иначе
					ПартнерКонтрагента = Неопределено;
				КонецЕсли;
				СписокПартнеров = Новый СписокЗначений;
				ПартнерыИКонтрагенты.ЗаполнитьСписокПартнераСРодителями(ПартнерКонтрагента, СписокПартнеров);
				Элементы.ОтборПартнер.Заголовок = ПартнерКонтрагента;
				Элементы.ОтборПартнер.Видимость = Истина;
				Элементы.ЗаголовокПартнер.Видимость = Истина;
				Параметры.Отбор.Вставить("Партнер", СписокПартнеров);
				УстановленоОтборов = УстановленоОтборов + 1;
			ИначеЕсли ТипЗнч(Параметры.Отбор.Контрагент) = Тип("СправочникСсылка.Организации") Тогда
				Параметры.Отбор.Вставить("Партнер", Справочники.Партнеры.НашеПредприятие);
				Элементы.ОтборПартнер.Заголовок = Справочники.Партнеры.НашеПредприятие;
				Элементы.ОтборПартнер.Видимость = Истина;
				Элементы.ЗаголовокПартнер.Видимость = Истина;
				УстановленоОтборов = УстановленоОтборов + 1;
			КонецЕсли;
			Элементы.ОтборКонтрагент.Видимость = Ложь;
			Элементы.ЗаголовокКонтрагент.Видимость = Ложь;
		Иначе
			Элементы.ОтборКонтрагент.Заголовок = ТекстЗаголовка(Параметры.Отбор.Контрагент);
			УстановленоОтборов = УстановленоОтборов + 1;
		КонецЕсли;
		
		ОтборКонтрагента = Параметры.Отбор.Контрагент;
		Если ТипЗнч(Параметры.Отбор.Контрагент) = Тип("СправочникСсылка.Организации") Тогда
			Запрос = Новый Запрос(
			"
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Организации.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.Ссылка В (&Организация)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Организации.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.ГоловнаяОрганизация В (&Организация)
			|	И Организации.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию
			|АВТОУПОРЯДОЧИВАНИЕ");
			
			Запрос.УстановитьПараметр("Организация", Параметры.Отбор.Контрагент);
			ОтборКонтрагента = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			Элементы.ОтборКонтрагент.Заголовок = ТекстЗаголовка(ОтборКонтрагента);
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокОбъектовРасчетов,
			"Контрагент",
			ОтборКонтрагента,
			ВидСравненияКомпоновкиДанных.ВСписке,
			,
			ЗначениеЗаполнено(Параметры.Отбор.Контрагент));
		
		Если Параметры.ВыборОснованияПлатежа Тогда
			СписокОснованийПлатежа.Параметры.УстановитьЗначениеПараметра("Контрагент", ОтборКонтрагента);
			СписокДоговоровКонтрагентов.Параметры.УстановитьЗначениеПараметра("Контрагент", ОтборКонтрагента);
			СписокДоговоровМеждуОрганизациями.Параметры.УстановитьЗначениеПараметра("Контрагент", ОтборКонтрагента);
		КонецЕсли;
		
	Иначе
		Элементы.ОтборКонтрагент.Видимость = Ложь;
		Элементы.ЗаголовокКонтрагент.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Организация") Тогда
		
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ПоВсемОрганизациям", Ложь);
		ОтборОрганизация = Параметры.Отбор.Организация;
		
		ЦентрализованныеДоговоры = Новый Массив;
		ГоловнаяОрганизация      = Неопределено;
		ЭтоГоловнаяОрганизация   = Ложь;
		
		Если ТипЗнч(Параметры.Отбор.Организация) <> Тип("Массив") И Параметры.УчитыватьФилиалы Тогда
			
			ГоловнаяОрганизация      = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Отбор.Организация, "ГоловнаяОрганизация");
			ЭтоГоловнаяОрганизация   = Параметры.Отбор.Организация = ГоловнаяОрганизация;
			
			Если НЕ ЭтоГоловнаяОрганизация Тогда
				
				Запрос = Новый Запрос(
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	Филиалы.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.ДоговорыКонтрагентов.Филиалы КАК Филиалы
					|ГДЕ
					|	Филиалы.Организация = &Организация
					|");
				
				Запрос.УстановитьПараметр("Организация",Параметры.Отбор.Организация);
				ЦентрализованныеДоговоры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
				
			Иначе
				
				ГоловнаяОрганизация = Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ЭтоГоловнаяОрганизация",   ЭтоГоловнаяОрганизация);
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ГоловнаяОрганизация",      ГоловнаяОрганизация);
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ЦентрализованныеДоговоры", ЦентрализованныеДоговоры);
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("Организация",              Параметры.Отбор.Организация);
		
		УстановленоОтборов = УстановленоОтборов + 1;
		
		Элементы.ОтборОрганизация.Заголовок = ТекстЗаголовка(Параметры.Отбор.Организация);
		
		Если Параметры.ВыборОснованияПлатежа Тогда
			СписокОснованийПлатежа.Параметры.УстановитьЗначениеПараметра("ЭтоГоловнаяОрганизация",   ЭтоГоловнаяОрганизация);
			СписокОснованийПлатежа.Параметры.УстановитьЗначениеПараметра("ГоловнаяОрганизация",      ГоловнаяОрганизация);
			СписокОснованийПлатежа.Параметры.УстановитьЗначениеПараметра("ЦентрализованныеДоговоры", ЦентрализованныеДоговоры);
			СписокОснованийПлатежа.Параметры.УстановитьЗначениеПараметра("Организация",              Параметры.Отбор.Организация);
			
			СписокДоговоровКонтрагентов.Параметры.УстановитьЗначениеПараметра("ЭтоГоловнаяОрганизация",   ЭтоГоловнаяОрганизация);
			СписокДоговоровКонтрагентов.Параметры.УстановитьЗначениеПараметра("ГоловнаяОрганизация",      ГоловнаяОрганизация);
			СписокДоговоровКонтрагентов.Параметры.УстановитьЗначениеПараметра("ЦентрализованныеДоговоры", ЦентрализованныеДоговоры);
			СписокДоговоровКонтрагентов.Параметры.УстановитьЗначениеПараметра("Организация",              Параметры.Отбор.Организация);
			
			СписокДоговоровМеждуОрганизациями.Параметры.УстановитьЗначениеПараметра("Организация",              Параметры.Отбор.Организация);
		КонецЕсли;
		
	Иначе
		Элементы.ОтборОрганизация.Видимость = Ложь;
		Элементы.ЗаголовокОрганизация.Видимость = Ложь;
		
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ПоВсемОрганизациям", Истина);
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("Организация", Неопределено);
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ЭтоГоловнаяОрганизация", Ложь);
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ЦентрализованныеДоговоры", Новый Массив);
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ГоловнаяОрганизация", Неопределено);
		
		СписокОснованийПлатежа.Параметры.УстановитьЗначениеПараметра("Организация", Неопределено);
		СписокОснованийПлатежа.Параметры.УстановитьЗначениеПараметра("ЭтоГоловнаяОрганизация", Ложь);
		СписокОснованийПлатежа.Параметры.УстановитьЗначениеПараметра("ЦентрализованныеДоговоры", Новый Массив);
		СписокОснованийПлатежа.Параметры.УстановитьЗначениеПараметра("ГоловнаяОрганизация", Неопределено);
		
		СписокДоговоровКонтрагентов.Параметры.УстановитьЗначениеПараметра("Организация", Неопределено);
		СписокДоговоровКонтрагентов.Параметры.УстановитьЗначениеПараметра("ЭтоГоловнаяОрганизация", Ложь);
		СписокДоговоровКонтрагентов.Параметры.УстановитьЗначениеПараметра("ЦентрализованныеДоговоры", Новый Массив);
		СписокДоговоровКонтрагентов.Параметры.УстановитьЗначениеПараметра("ГоловнаяОрганизация", Неопределено);
		
		СписокДоговоровМеждуОрганизациями.Параметры.УстановитьЗначениеПараметра("Организация", Неопределено);
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ВалютаВзаиморасчетов") И ЗначениеЗаполнено(Параметры.Отбор.ВалютаВзаиморасчетов) Тогда
		Элементы.ОтборВалютаВзаиморасчетов.Заголовок = Параметры.Отбор.ВалютаВзаиморасчетов;
		УстановленоОтборов = УстановленоОтборов + 1;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокОбъектовРасчетов,
			"ВалютаВзаиморасчетов",
			Параметры.Отбор.ВалютаВзаиморасчетов,
			ВидСравненияКомпоновкиДанных.Равно,
			,
			ЗначениеЗаполнено(Параметры.Отбор.ВалютаВзаиморасчетов));
	Иначе
		Элементы.ОтборВалютаВзаиморасчетов.Видимость = Ложь;
		Элементы.ЗаголовокВалютаВзаиморасчетов.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.РедактируемыйДокумент) Тогда
		ИсключаемыйОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(Параметры.РедактируемыйДокумент,,
			?(Параметры.Отбор.Свойство("ТипРасчетов"),Параметры.Отбор.ТипРасчетов,Неопределено));
		Если ЗначениеЗаполнено(ИсключаемыйОбъектРасчетов) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				СписокОбъектовРасчетов,
				"ОбъектРасчетов",
				ИсключаемыйОбъектРасчетов,
				ВидСравненияКомпоновкиДанных.НеРавно,
				,
				ЗначениеЗаполнено(ИсключаемыйОбъектРасчетов));
				
			Если Параметры.ВыборОснованияПлатежа Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
					СписокОснованийПлатежа,
					"ОбъектРасчетов",
					ИсключаемыйОбъектРасчетов,
					ВидСравненияКомпоновкиДанных.НеРавно,
					,
					ЗначениеЗаполнено(ИсключаемыйОбъектРасчетов));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТипыОснований = Новый Массив;
	Если Параметры.ВыборОснованияПлатежа И Параметры.РедактируемыйДокумент <> Неопределено Тогда
		МетаданныеДокумента = Параметры.РедактируемыйДокумент.Метаданные();
		Если МетаданныеДокумента <> Неопределено Тогда
			ОписаниеТипов = Новый ОписаниеТипов;
			Если ОбщегоНазначенияУТ.ЕстьРеквизитТабЧастиОбъекта("ОснованиеПлатежа", МетаданныеДокумента, "РасшифровкаПлатежа") Тогда 
				ОписаниеТипов = МетаданныеДокумента.ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты.ОснованиеПлатежа.Тип;
			ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("ОснованиеПлатежа") <> Неопределено Тогда
				ОписаниеТипов = МетаданныеДокумента.Реквизиты.ОснованиеПлатежа.Тип;
			КонецЕсли;
			ТипыОснований = ОписаниеТипов.Типы();
		КонецЕсли;
	КонецЕсли;
	СписокОснованийПлатежа.Параметры.УстановитьЗначениеПараметра("ТипыОснований", ТипыОснований);
	
	ИспользоватьДоговорыМеждуОрганизациями = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыМеждуОрганизациями");
	Если Параметры.ВыборОснованияПлатежа Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОснованиеПлатежа;
		Если Параметры.Свойство("ТекущееЗначение") Тогда
			НачальноеОснованиеПлатежа = Параметры.ТекущееЗначение;
		КонецЕсли;
		Элементы.ГруппаОбъектРасчетов.Видимость = Ложь;
		Элементы.ГруппаОснованиеПлатежаПоТипам.ТекущаяСтраница = Элементы.ГруппаДокументы;
		ПереключательВыбораОснования = 0;
		Если ЗначениеЗаполнено(НачальноеОснованиеПлатежа) Тогда
			Если ТипЗнч(НачальноеОснованиеПлатежа) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Элементы.ГруппаОснованиеПлатежаПоТипам.ТекущаяСтраница = Элементы.ГруппаДоговорыКонтрагентов;
				ПереключательВыбораОснования = 1;
			ИначеЕсли ТипЗнч(НачальноеОснованиеПлатежа) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда
				Элементы.ГруппаОснованиеПлатежаПоТипам.ТекущаяСтраница = Элементы.ГруппаДоговорыМеждуОрганизациями;
				ПереключательВыбораОснования = 1;
			КонецЕсли;
		КонецЕсли;
		Если ЭтоРасчетыМеждуОрганизациями И Не ИспользоватьДоговорыМеждуОрганизациями Тогда
			Элементы.ПереключательВыбораОснования.Видимость = Ложь;
			Элементы.ГруппаОснованиеПлатежаПоТипам.ТекущаяСтраница = Элементы.ГруппаДокументы;
		КонецЕсли;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбъектРасчетов;
		Если Параметры.Свойство("ТекущееЗначение") Тогда
			НачальныйОбъектРасчетов = Параметры.ТекущееЗначение;
		КонецЕсли;
		Элементы.ГруппаОснованиеПлатежа.Видимость = Ложь;
	КонецЕсли;
	
	ВыбратьОбъектыРасчетовПоКомиссии = Неопределено;
	Параметры.Свойство("ВыбратьОбъектыРасчетовПоКомиссии", ВыбратьОбъектыРасчетовПоКомиссии);
	
	Если Не ВыбратьОбъектыРасчетовПоКомиссии = Неопределено Тогда
		
		Если ВыбратьОбъектыРасчетовПоКомиссии.ВыбратьОбъектыРасчетовСКонечнымКлиентом Тогда
			
			СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ВыбратьОбъектыРасчетовСКонечнымКлиентом", Истина);
			СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ВыбратьОбъектыРасчетовСКомиссионером", Ложь);
			СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ДоговорСКомиссионером",
				ВыбратьОбъектыРасчетовПоКомиссии.ДоговорСКомиссионером);
			СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("КлиентКонтрагент",
				ВыбратьОбъектыРасчетовПоКомиссии.Контрагент);
			СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("КлиентПартнер",
				ВыбратьОбъектыРасчетовПоКомиссии.Партнер);
				
			Элементы.ЗаголовокКомиссионныеПродажи.Заголовок = НСтр("ru = 'C конечным клиентом'");
			Элементы.ОтборКомиссионныхДоговоров.Заголовок = СтрШаблон(
					НСтр("ru='""%1"" по договору с комиссионером ""%2""'"), 
						ВыбратьОбъектыРасчетовПоКомиссии.Контрагент,
						ВыбратьОбъектыРасчетовПоКомиссии.ДоговорСКомиссионером);
			
			Элементы.ЗаголовокКомиссионныеПродажи.Видимость = Истина;
			Элементы.ОтборКомиссионныхДоговоров.Видимость = Истина;
			УстановленоОтборов = УстановленоОтборов + 1;
			
		Иначе
			
			СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ВыбратьОбъектыРасчетовСКонечнымКлиентом", Ложь);
			СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ВыбратьОбъектыРасчетовСКомиссионером", Истина);
			СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ДоговорСКомиссионером", Неопределено);
			СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("КлиентКонтрагент", Неопределено);
			СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("КлиентПартнер", Неопределено);
			
			Элементы.ОтборКомиссионныхДоговоров.Заголовок = НСтр("ru='С комиссионером'");
			
			Элементы.ЗаголовокКомиссионныеПродажи.Видимость = Истина;
			Элементы.ОтборКомиссионныхДоговоров.Видимость = Истина;
			УстановленоОтборов = УстановленоОтборов + 1;
			
		КонецЕсли;
		
	Иначе
			
		Элементы.ЗаголовокКомиссионныеПродажи.Видимость = Ложь;
		Элементы.ОтборКомиссионныхДоговоров.Видимость = Ложь;
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ВыбратьОбъектыРасчетовСКонечнымКлиентом", Ложь);
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ВыбратьОбъектыРасчетовСКомиссионером", Ложь);
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ДоговорСКомиссионером", Неопределено);
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("КлиентКонтрагент", Неопределено);
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("КлиентПартнер", Неопределено);
		
	КонецЕсли;
	
	Если УстановленоОтборов > 0 Тогда
		Элементы.ГруппаПредустановленныеОтборы.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Установлено отборов: %1'"), УстановленоОтборов);
	Иначе
		Элементы.ГруппаПредустановленныеОтборы.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ПодборДебиторскойЗадолженности") Тогда
		Элементы.ОбъектыРасчетовСуммаОстаток.Заголовок = ?(Параметры.ПодборДебиторскойЗадолженности, НСтр("ru = 'Дебиторская задолженность'"), НСтр("ru = 'Кредиторская задолженность'"));
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ПодборДебиторскойЗадолженности", Параметры.ПодборДебиторскойЗадолженности);
		СписокОснованийПлатежа.Параметры.УстановитьЗначениеПараметра("ПодборДебиторскойЗадолженности", Параметры.ПодборДебиторскойЗадолженности);
	Иначе
		Элементы.ОбъектыРасчетовСуммаОстаток.Заголовок = НСтр("ru = 'Дебиторская задолженность'");
		СписокОбъектовРасчетов.Параметры.УстановитьЗначениеПараметра("ПодборДебиторскойЗадолженности", Истина);
		СписокОснованийПлатежа.Параметры.УстановитьЗначениеПараметра("ПодборДебиторскойЗадолженности", Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("ВернутьСтруктуру") Тогда
		ВернутьСтруктуру = Параметры.ВернутьСтруктуру;
	КонецЕсли;
	
	ИспользоватьНесколькоВалют     = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют");

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбъектыРасчетовВалюта", "Видимость", ИспользоватьНесколькоВалют);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОснованияПлатежаВалюта", "Видимость", ИспользоватьНесколькоВалют);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если ЗначениеЗаполнено(НачальноеОснованиеПлатежа) Тогда
		Если ТипЗнч(НачальноеОснованиеПлатежа) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Элементы.СписокДоговоровКонтрагентов.ТекущаяСтрока = НачальноеОснованиеПлатежа;
		ИначеЕсли ТипЗнч(НачальноеОснованиеПлатежа) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда
			Элементы.СписокДоговоровМеждуОрганизациями.ТекущаяСтрока = НачальноеОснованиеПлатежа;
		Иначе
			Элементы.ОснованияПлатежа.ТекущаяСтрока = КлючЗаписиРеестраДокументов(НачальноеОснованиеПлатежа, ОтборОрганизация);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(НачальныйОбъектРасчетов) Тогда
		Элементы.ОбъектыРасчетов.ТекущаяСтрока = НачальныйОбъектРасчетов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	Если Элементы.ОбъектыРасчетов.ТекущаяСтрока <> Неопределено 
		И Элементы.ОбъектыРасчетов.ТекущиеДанные.ТипОбъектаРасчетов <> ОтборПоТипу Тогда
		ОтборПоТипу = ПредопределенноеЗначение("Перечисление.ТипыОбъектовРасчетов.ПустаяСсылка");
	КонецЕсли;
	УстановитьОтборПоТипу();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбъектыРасчетовПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЗначенийКлиент = Новый ТаблицаЗначений;
	ТаблицаЗначенийКлиент.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
	
	ТаблицаЗначенийПоставщик = Новый ТаблицаЗначений;
	ТаблицаЗначенийПоставщик.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
	
	Для Каждого Строка Из Строки Цикл
		
		Если Строка.Значение.Данные.СуммаОстаток <> 0 ИЛИ Строка.Значение.Данные.КОплате <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.Значение.Данные.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаЗначенийКлиент.Добавить(),Строка.Значение.Данные,"Ссылка");
		ИначеЕсли Строка.Значение.Данные.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаЗначенийПоставщик.Добавить(),Строка.Значение.Данные,"Ссылка");
		КонецЕсли;
	КонецЦикла;
	
	МассивТекстов = Новый Массив;
	
	Если ТаблицаЗначенийКлиент.Количество() > 0 Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.ОбъектРасчетов КАК Ссылка,
		|	ВЫБОР 
		|		КОГДА &ПодборДебиторскойЗадолженности И Расчеты.СуммаОстаток < 0
		|			ИЛИ НЕ &ПодборДебиторскойЗадолженности И Расчеты.СуммаОстаток > 0
		|				ТОГДА 0
		|		КОГДА Расчеты.СуммаОстаток < 0 
		|				ТОГДА - Расчеты.СуммаОстаток
		|		ИНАЧЕ Расчеты.СуммаОстаток
		|	КОНЕЦ КАК СуммаОстаток,
		|	ВЫБОР 
		|		КОГДА Расчеты.КОплатеОстаток + Расчеты.ОплачиваетсяОстаток > 0
		|			ТОГДА Расчеты.КОплатеОстаток + Расчеты.ОплачиваетсяОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КОплате
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(,ОбъектРасчетов В (ВЫБРАТЬ Ссылка ИЗ ВтТаблицаЗначенийКлиент)) КАК Расчеты";
		МассивТекстов.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	Если ТаблицаЗначенийПоставщик.Количество() > 0 Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.ОбъектРасчетов КАК Ссылка,
		|	ВЫБОР 
		|		КОГДА &ПодборДебиторскойЗадолженности И Расчеты.СуммаОстаток < 0
		|			ИЛИ НЕ &ПодборДебиторскойЗадолженности И Расчеты.СуммаОстаток > 0
		|				ТОГДА 0
		|		КОГДА Расчеты.СуммаОстаток < 0 
		|				ТОГДА - Расчеты.СуммаОстаток
		|		ИНАЧЕ Расчеты.СуммаОстаток
		|	КОНЕЦ КАК СуммаОстаток,
		|	ВЫБОР 
		|		КОГДА Расчеты.ОплачиваетсяОстаток - Расчеты.КОплатеОстаток > 0
		|			ТОГДА Расчеты.ОплачиваетсяОстаток - Расчеты.КОплатеОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КОплате
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки(,ОбъектРасчетов В (ВЫБРАТЬ Ссылка ИЗ ВтТаблицаЗначенийПоставщик)) КАК Расчеты";
		Если МассивТекстов.Количество() > 0 Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ВЫБРАТЬ"); //@Query-part-1 @Query-part-2
		КонецЕсли;
		МассивТекстов.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	Если МассивТекстов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТаблицаЗначений.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВтТаблицаЗначенийКлиент
		|ИЗ 
		|	&ТаблицаЗначенийКлиент КАК ТаблицаЗначений
		|;
		|ВЫБРАТЬ
		|	ТаблицаЗначений.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВтТаблицаЗначенийПоставщик
		|ИЗ 
		|	&ТаблицаЗначенийПоставщик КАК ТаблицаЗначений
		|;"
		+ СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	Запрос.УстановитьПараметр("ПодборДебиторскойЗадолженности", 
		Настройки.ПараметрыДанных.Элементы.Найти("ПодборДебиторскойЗадолженности").Значение);
	Запрос.УстановитьПараметр("ТаблицаЗначенийКлиент", ТаблицаЗначенийКлиент);
	Запрос.УстановитьПараметр("ТаблицаЗначенийПоставщик", ТаблицаЗначенийПоставщик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаСписка = Строки[Выборка.Ссылка];
		ЗаполнитьЗначенияСвойств(СтрокаСписка.Данные,Выборка,"КОплате, СуммаОстаток");
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТолькоСОстаткомПриИзменении(Элемент)
	ОбновитьТекстЗапросаОбъектовРасчетов();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоТипуПриИзменении(Элемент)
	УстановитьОтборПоТипу();
КонецПроцедуры

&НаКлиенте
Процедура ПереключательВыбораОснованияПриИзменении(Элемент)
	Если ПереключательВыбораОснования = 1 Тогда
		Если ЭтоРасчетыМеждуОрганизациями Тогда
			Элементы.ГруппаОснованиеПлатежаПоТипам.ТекущаяСтраница = Элементы.ГруппаДоговорыМеждуОрганизациями;
		Иначе
			Элементы.ГруппаОснованиеПлатежаПоТипам.ТекущаяСтраница = Элементы.ГруппаДоговорыКонтрагентов;
		КонецЕсли;
	Иначе
		Элементы.ГруппаОснованиеПлатежаПоТипам.ТекущаяСтраница = Элементы.ГруппаДокументы;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбъектРасчетов Тогда
		СтрокаТаблицы = Элементы.ОбъектыРасчетов.ТекущиеДанные;
		Если СтрокаТаблицы <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицы.ОбъектРасчетов) Тогда
			ПоказатьЗначение(Неопределено, СтрокаТаблицы.ОбъектРасчетов);
		КонецЕсли;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОснованиеПлатежа Тогда 
		Если Элементы.ГруппаОснованиеПлатежаПоТипам.ТекущаяСтраница = Элементы.ГруппаДокументы Тогда
			СтрокаТаблицы = Элементы.ОснованияПлатежа.ТекущиеДанные;
		ИначеЕсли Элементы.ГруппаОснованиеПлатежаПоТипам.ТекущаяСтраница = Элементы.ГруппаДоговорыКонтрагентов Тогда 
			СтрокаТаблицы = Элементы.СписокДоговоровКонтрагентов.ТекущиеДанные;
		Иначе
			СтрокаТаблицы = Элементы.СписокДоговоровМеждуОрганизациями.ТекущиеДанные;
		КонецЕсли;
		Если СтрокаТаблицы <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицы.ОснованиеПлатежа) Тогда
			ПоказатьЗначение(Неопределено, СтрокаТаблицы.ОснованиеПлатежа);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокумент(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбъектРасчетов Тогда
		СтрокаТаблицы = Элементы.ОбъектыРасчетов.ТекущиеДанные;
	Иначе
		СтрокаТаблицы = Элементы.ОснованияПлатежа.ТекущиеДанные;
	КонецЕсли;
	
	Если СтрокаТаблицы <> Неопределено Тогда
		Если ВернутьСтруктуру Тогда
			РезультатВыбора = РезультатВыбора(СтрокаТаблицы, Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбъектРасчетов);
		Иначе
			РезультатВыбора = СтрокаТаблицы.ОбъектРасчетов;
		КонецЕсли;
		ОповеститьОВыборе(РезультатВыбора);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовНомер.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовДата.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовТипСсылки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовСумма.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовВалюта.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовСуммаОстаток.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовВалютаВзаиморасчетов.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовОрганизация.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовПартнер.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовДоговор.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовКонтрагент.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовНомерВходящегоДокумента.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовДатаВходящегоДокумента.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СсылкаНаОбъектРасчетов.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокОбъектовРасчетов.Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 1;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокОбъектовРасчетов.ТипОбъектаРасчетов");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыОбъектовРасчетов.Договор;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыРасчетовТипСсылки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокОбъектовРасчетов.ТипСсылки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Объект не указан>'"));
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтаФорма, "СписокОснованийПлатежа.Дата", "ОснованияПлатежаДата");
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтаФорма, "СписокОснованийПлатежа.ДатаВходящегоДокумента", "ОснованияПлатежаДатаВходящегоДокумента");

КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтрокаТаблицы = Элементы.ОбъектыРасчетов.ТекущиеДанные;
	Если ВернутьСтруктуру Тогда
		РезультатВыбора = РезультатВыбора(СтрокаТаблицы);
	Иначе
		РезультатВыбора = СтрокаТаблицы.ОбъектРасчетов;
	КонецЕсли;
	ОповеститьОВыборе(РезультатВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ОснованияПлатежаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтрокаТаблицы = Элементы.ОснованияПлатежа.ТекущиеДанные;
	РезультатВыбора = РезультатВыбора(СтрокаТаблицы, Ложь);
	ОповеститьОВыборе(РезультатВыбора);
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровКонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтрокаТаблицы = Элементы.СписокДоговоровКонтрагентов.ТекущиеДанные;
	РезультатВыбора = РезультатВыбора(СтрокаТаблицы, Ложь);
	ОповеститьОВыборе(РезультатВыбора);
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровМеждуОрганизациямиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтрокаТаблицы = Элементы.СписокДоговоровМеждуОрганизациями.ТекущиеДанные;
	РезультатВыбора = РезультатВыбора(СтрокаТаблицы, Ложь);
	ОповеститьОВыборе(РезультатВыбора);
КонецПроцедуры

&НаКлиенте
Функция РезультатВыбора(СтрокаТаблицы, ВыборОбъектаРасчетов = Истина)
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("ОснованиеПлатежа", ?(СтрокаТаблицы.Свойство("ОснованиеПлатежа"), СтрокаТаблицы.ОснованиеПлатежа, Неопределено));
	РезультатВыбора.Вставить("Организация", СтрокаТаблицы.Организация);
	РезультатВыбора.Вставить("Партнер", СтрокаТаблицы.Партнер);
	РезультатВыбора.Вставить("Контрагент", СтрокаТаблицы.Контрагент);
	РезультатВыбора.Вставить("Договор", СтрокаТаблицы.Договор);
	РезультатВыбора.Вставить("НаправлениеДеятельности", СтрокаТаблицы.НаправлениеДеятельности);
	РезультатВыбора.Вставить("СуммаВзаиморасчетов", 0);
	РезультатВыбора.Вставить("Дата", СтрокаТаблицы.Дата);
	РезультатВыбора.Вставить("Номер", СтрокаТаблицы.Номер);
	РезультатВыбора.Вставить("СтавкаНДС", ПредопределенноеЗначение("Справочник.СтавкиНДС.ПустаяСсылка"));
	РезультатВыбора.Вставить("СуммаНДС", 0);
	РезультатВыбора.Вставить("СуммаЗаказа", СтрокаТаблицы.Сумма);
	РезультатВыбора.Вставить("СуммаПлатежа", СуммаПлатежа);
	РезультатВыбора.Вставить("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
	РезультатВыбора.Вставить("ОбъектРасчетов", СтрокаТаблицы.ОбъектРасчетов);
	РезультатВыбора.Вставить("ВалютаВзаиморасчетов", СтрокаТаблицы.ВалютаВзаиморасчетов);
	
	Если Не (ЗначениеЗаполнено(СтрокаТаблицы.ОбъектРасчетов) Или ВыборОбъектаРасчетов) Тогда
		РезультатВыбора.Вставить("ДокументОснование", СтрокаТаблицы.ДокументОснование);
		ДополнитьСтруктуруОбъектомРасчетовИВалютойВзаиморасчетов(РезультатВыбора);
	КонецЕсли;
	
	Возврат РезультатВыбора;
	
КонецФункции

&НаСервере
Функция ТекстЗаголовка(Элементы, ИмяРеквизита = "Наименование")
	
	Если ТипЗнч(Элементы) = Тип("Массив") Тогда
		Реквизиты = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Элементы, ИмяРеквизита);
		Имена = Новый Массив;
		Для Каждого Элемент Из Элементы Цикл
			Имена.Добавить(Реквизиты[Элемент]);
		КонецЦикла;
		ТекстЗаголовка = СтрСоединить(Имена, Символы.ПС);
	Иначе
		ТекстЗаголовка = Элементы;
	КонецЕсли;
	
	Возврат ТекстЗаголовка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаОснованийПлатежа(ЭтоРасчетыСКлиентом, СтруктураОтбора, ТипОснования)
	
	Возврат 
		ВзаиморасчетыСервер.ТекстЗапросаВыбораОснованияПлатежа(
			Ложь, 
			СтруктураОтбора, 
			Истина,
			ЭтоРасчетыСКлиентом, 
			Ложь, 
			ТипОснования);
	
КонецФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	ОбновитьТекстЗапросаОбъектовРасчетов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстЗапросаОбъектовРасчетов()
	
	Если НЕ ТолькоСОстатком Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ 
		|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов, 
		|	ОбъектыРасчетов.Ссылка КАК Ссылка,
		|	ОбъектыРасчетов.ПометкаУдаления, 
		|	ОбъектыРасчетов.Наименование, 
		|	ОбъектыРасчетов.Объект, 
		|	ОбъектыРасчетов.Объект КАК ОснованиеПлатежа,
		|	ОбъектыРасчетов.ТипРасчетов,
		|	ОбъектыРасчетов.ТипОбъектаРасчетов,
		|	ОбъектыРасчетов.ТипСсылки, 
		|	ОбъектыРасчетов.ГруппаФинансовогоУчета, 
		|	ОбъектыРасчетов.Менеджер, 
		|	ОбъектыРасчетов.Подразделение, 
		|	ОбъектыРасчетов.ИдентификаторПлатежа, 
		|	ОбъектыРасчетов.Номер, 
		|	ОбъектыРасчетов.Дата, 
		|	ОбъектыРасчетов.НомерВходящегоДокумента, 
		|	ОбъектыРасчетов.ДатаВходящегоДокумента, 
		|	ОбъектыРасчетов.НаименованиеПервичногоДокумента, 
		|	ОбъектыРасчетов.Сумма, 
		|	ОбъектыРасчетов.Валюта, 
		|	ОбъектыРасчетов.Состояние,
		|	ОбъектыРасчетов.Партнер,
		|	ОбъектыРасчетов.Организация, 
		|	ОбъектыРасчетов.Контрагент, 
		|	ОбъектыРасчетов.Договор, 
		|	ОбъектыРасчетов.НаправлениеДеятельности, 
		|	ОбъектыРасчетов.ОплатаВВалюте, 
		|	ОбъектыРасчетов.ВалютаВзаиморасчетов,
		|	&ПодборДебиторскойЗадолженности КАК ПодборДебиторскойЗадолженности,
		|	ОбъектыРасчетов.ТолькоОстатки   КАК ТолькоОстатки,
		|	0 КАК СуммаОстаток,
		|	0 КАК КОплате
		|ИЗ
		|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
		|			ПО ОбъектыРасчетов.Договор = Договоры.Ссылка
		|ГДЕ
		|	НЕ &ВыборОснованияПлатежа
		|	И (ОбъектыРасчетов.Организация В (&Организация) 
		|		ИЛИ НЕ &ЭтоГоловнаяОрганизация 
		|			И ОбъектыРасчетов.Договор В (&ЦентрализованныеДоговоры)
		|			И (ОбъектыРасчетов.Организация = &ГоловнаяОрганизация
		|				ИЛИ Договоры.РазрешаетсяПередачаОплатМеждуФилиалами)
		|		ИЛИ &ЭтоГоловнаяОрганизация
		|			И ОбъектыРасчетов.Организация.ГоловнаяОрганизация В (&Организация)
		|			И ОбъектыРасчетов.Организация.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию
		|		ИЛИ &ПоВсемОрганизациям)
		|	И ((Договоры.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СКомиссионером) И Договоры.КомиссионныеПродажи25) ИЛИ НЕ &ВыбратьОбъектыРасчетовСКомиссионером)
		|	И (Договоры.ДоговорСКомиссионером = &ДоговорСКомиссионером И Договоры.Контрагент = &КлиентКонтрагент И Договоры.Партнер = &КлиентПартнер ИЛИ НЕ &ВыбратьОбъектыРасчетовСКонечнымКлиентом)
		|	И НЕ (ОбъектыРасчетов.Объект ССЫЛКА Справочник.ПодарочныеСертификаты)
		|";
	Иначе
		Если ЭтоРасчетыСКлиентами Тогда
			ТекстОстатки = "
				|ВЫБРАТЬ
				|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
				|	ВЫБОР 
				|		КОГДА &ПодборДебиторскойЗадолженности И Расчеты.СуммаОстаток < 0
				|			ИЛИ НЕ &ПодборДебиторскойЗадолженности И Расчеты.СуммаОстаток > 0
				|				ТОГДА 0
				|		КОГДА Расчеты.СуммаОстаток < 0 
				|				ТОГДА - Расчеты.СуммаОстаток
				|		ИНАЧЕ Расчеты.СуммаОстаток
				|	КОНЕЦ КАК СуммаОстаток,
				|	ВЫБОР 
				|		КОГДА Расчеты.КОплатеОстаток + Расчеты.ОплачиваетсяОстаток > 0
				|			ТОГДА Расчеты.КОплатеОстаток + Расчеты.ОплачиваетсяОстаток
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК КОплате
				|ПОМЕСТИТЬ ВтОстатки
				|ИЗ
				|	РегистрНакопления.РасчетыСКлиентами.Остатки() КАК Расчеты
				|ИНДЕКСИРОВАТЬ ПО
				|	ОбъектРасчетов
				|;";
		Иначе
			ТекстОстатки = "
				|ВЫБРАТЬ
				|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
				|	ВЫБОР 
				|		КОГДА &ПодборДебиторскойЗадолженности И Расчеты.СуммаОстаток < 0
				|			ИЛИ НЕ &ПодборДебиторскойЗадолженности И Расчеты.СуммаОстаток > 0
				|				ТОГДА 0
				|		КОГДА Расчеты.СуммаОстаток < 0 
				|				ТОГДА - Расчеты.СуммаОстаток
				|		ИНАЧЕ Расчеты.СуммаОстаток
				|	КОНЕЦ КАК СуммаОстаток,
				|	ВЫБОР 
				|		КОГДА Расчеты.КОплатеОстаток + Расчеты.ОплачиваетсяОстаток > 0
				|			ТОГДА Расчеты.КОплатеОстаток + Расчеты.ОплачиваетсяОстаток
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК КОплате
				|ПОМЕСТИТЬ ВтОстатки
				|ИЗ
				|	РегистрНакопления.РасчетыСПоставщиками.Остатки() КАК Расчеты
				|ИНДЕКСИРОВАТЬ ПО
				|	ОбъектРасчетов
				|;";
		КонецЕсли;
		
		ТекстЗапроса = ТекстОстатки+ "
		|ВЫБРАТЬ 
		|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов, 
		|	ОбъектыРасчетов.Ссылка КАК Ссылка,
		|	ОбъектыРасчетов.ПометкаУдаления, 
		|	ОбъектыРасчетов.Наименование, 
		|	ОбъектыРасчетов.Объект, 
		|	ОбъектыРасчетов.Объект КАК ОснованиеПлатежа,
		|	ОбъектыРасчетов.ТипРасчетов,
		|	ОбъектыРасчетов.ТипОбъектаРасчетов,
		|	ОбъектыРасчетов.ТипСсылки, 
		|	ОбъектыРасчетов.ГруппаФинансовогоУчета, 
		|	ОбъектыРасчетов.Менеджер, 
		|	ОбъектыРасчетов.Подразделение, 
		|	ОбъектыРасчетов.ИдентификаторПлатежа, 
		|	ОбъектыРасчетов.Номер, 
		|	ОбъектыРасчетов.Дата, 
		|	ОбъектыРасчетов.НомерВходящегоДокумента, 
		|	ОбъектыРасчетов.ДатаВходящегоДокумента, 
		|	ОбъектыРасчетов.НаименованиеПервичногоДокумента, 
		|	ОбъектыРасчетов.Сумма, 
		|	ОбъектыРасчетов.Валюта, 
		|	ОбъектыРасчетов.Состояние,
		|	ОбъектыРасчетов.Партнер,
		|	ОбъектыРасчетов.Организация, 
		|	ОбъектыРасчетов.Контрагент, 
		|	ОбъектыРасчетов.Договор, 
		|	ОбъектыРасчетов.НаправлениеДеятельности, 
		|	ОбъектыРасчетов.ОплатаВВалюте, 
		|	ОбъектыРасчетов.ВалютаВзаиморасчетов,
		|	&ПодборДебиторскойЗадолженности КАК ПодборДебиторскойЗадолженности,
		|	ОбъектыРасчетов.ТолькоОстатки   КАК ТолькоОстатки,
		|	Остатки.СуммаОстаток КАК СуммаОстаток,
		|	Остатки.КОплате КАК КОплате
		|ИЗ
		|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОстатки КАК Остатки 
		|			ПО Остатки.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
		|			ПО ОбъектыРасчетов.Договор = Договоры.Ссылка
		|ГДЕ
		|	НЕ &ВыборОснованияПлатежа
		|	И (Остатки.СуммаОстаток > 0 ИЛИ Остатки.Коплате > 0)
		|	И (ОбъектыРасчетов.Организация В (&Организация) 
		|		ИЛИ НЕ &ЭтоГоловнаяОрганизация 
		|			И ОбъектыРасчетов.Договор В (&ЦентрализованныеДоговоры)
		|			И (ОбъектыРасчетов.Организация = &ГоловнаяОрганизация
		|				ИЛИ Договоры.РазрешаетсяПередачаОплатМеждуФилиалами)
		|		ИЛИ &ЭтоГоловнаяОрганизация
		|			И ОбъектыРасчетов.Организация.ГоловнаяОрганизация В (&Организация)
		|			И ОбъектыРасчетов.Организация.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию
		|		ИЛИ &ПоВсемОрганизациям)
		|	И ((Договоры.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СКомиссионером) И Договоры.КомиссионныеПродажи25) ИЛИ НЕ &ВыбратьОбъектыРасчетовСКомиссионером)
		|	И (Договоры.ДоговорСКомиссионером = &ДоговорСКомиссионером И Договоры.Контрагент = &КлиентКонтрагент И Договоры.Партнер = &КлиентПартнер ИЛИ НЕ &ВыбратьОбъектыРасчетовСКонечнымКлиентом)
		|	И НЕ (ОбъектыРасчетов.Объект ССЫЛКА Справочник.ПодарочныеСертификаты)
		|";
	КонецЕсли;
	
	СписокОбъектовРасчетов.ТекстЗапроса = ТекстЗапроса;
	Элементы.ОбъектыРасчетов.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьСтруктуруОбъектомРасчетовИВалютойВзаиморасчетов(РезультатВыбора)
	
	ВзаиморасчетыСервер.ДополнитьСтруктуруОбъектомРасчетовИВалютойВзаиморасчетов(РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоТипу()
	
	Если ЗначениеЗаполнено(ОтборПоТипу) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокОбъектовРасчетов,
			"ТипОбъектаРасчетов",
			ОтборПоТипу,
			ВидСравненияКомпоновкиДанных.Равно,,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
			СписокОбъектовРасчетов,
			"ТипОбъектаРасчетов");
	КонецЕсли;
	Элементы.ОбъектыРасчетов.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючЗаписиРеестраДокументов(Документ, Организация)
	СтруктураИзмерений = Новый Структура("Ссылка, Организация", Документ, Организация);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	РеестрДокументов.ТипСсылки КАК ТипСсылки,
		|	РеестрДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	РеестрДокументов.Организация КАК Организация,
		|	РеестрДокументов.Партнер КАК Партнер,
		|	РеестрДокументов.МестоХранения КАК МестоХранения,
		|	РеестрДокументов.Контрагент КАК Контрагент,
		|	РеестрДокументов.Подразделение КАК Подразделение,
		|	РеестрДокументов.ДатаДокументаИБ КАК ДатаДокументаИБ,
		|	РеестрДокументов.Ссылка КАК Ссылка,
		|	РеестрДокументов.РазделительЗаписи КАК РазделительЗаписи
		|ИЗ
		|	РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|ГДЕ
		|	РеестрДокументов.Ссылка = &Ссылка
		|	И РеестрДокументов.Организация = &Организация";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураИзмерений.Вставить("ТипСсылки",             Выборка.ТипСсылки);
		СтруктураИзмерений.Вставить("ХозяйственнаяОперация", Выборка.ХозяйственнаяОперация);
		СтруктураИзмерений.Вставить("Организация",           Выборка.Организация);
		СтруктураИзмерений.Вставить("Партнер",               Выборка.Партнер);
		СтруктураИзмерений.Вставить("МестоХранения",         Выборка.МестоХранения);
		СтруктураИзмерений.Вставить("Контрагент",            Выборка.Контрагент);
		СтруктураИзмерений.Вставить("Подразделение",         Выборка.Подразделение);
		СтруктураИзмерений.Вставить("ДатаДокументаИБ",       Выборка.ДатаДокументаИБ);
		СтруктураИзмерений.Вставить("Ссылка",                Выборка.Ссылка);
		СтруктураИзмерений.Вставить("РазделительЗаписи",     Выборка.РазделительЗаписи);
	КонецЕсли;
	Возврат РегистрыСведений.РеестрДокументов.СоздатьКлючЗаписи(СтруктураИзмерений);
КонецФункции

#КонецОбласти
